app/views/news/show.html.erb

          <h2>Comments</h2>
          <% @news.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."news_id" = ?  [["news_id", 11]]