app/views/news/show_categories.html.erb

SELECT "news".* FROM "news" WHERE "news"."category_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "news".* FROM "news" WHERE "news"."category_id" = ? AND "news"."hidden" = ?  [["category_id", 9], ["hidden", 0]]
---
              <h2><%= category.name %></h2>
              <% if category.news.any? %>
              <!--   show only news that are not hidden-->
                <% category.news.where(hidden: false).each do |news| %>